DataProcessors/Renault_Загрузка_WS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_Загрузка_WS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьЦвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьКредитныеПрограммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/CRM_ИдентификаторыКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ИдентификаторыКартинок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ПараметрыКредитныхПрограмм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ПараметрыКредитныхПрограмм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальныйСрокКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйПервоначальныйВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйПервоначальныйВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаБанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркетинговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КредитнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ПрименениеКредитныхПрограмм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ПрименениеКредитныхПрограмм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПГВПодарок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПредложенияПродленнойГарантии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВариантыКомплектации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыКомплектации</Name>
			<Comment>Варианты комплектации автомобилей</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Модели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код варианта комплектации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование валюты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Comment>Тип двигателя автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКПП</Name>
					<Comment>Тип КПП автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТО</Name>
					<Comment>Межсервисный интервал для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТО</Name>
					<Comment>Межсервисный пробег для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьДвигателя</Name>
					<Comment>Мощность двигателя в л.с.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеннаяМаксимальнаяМасса</Name>
					<Comment>Разрешенная максимальная масса автомобиля в кг.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкологическиеКлассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодКомплектации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДвигателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МоделиДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодификацияАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модификации_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектации_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДверей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасположениеРуля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПередачКПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодификацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модификации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДром</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДром</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Привод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВидео</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКлассифайда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТОДжили</Name>
					<Comment>Суффикс кода автоработы ТО для Джили</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_Загрузка_WS/Ext/ObjectModule.bsl
Перем СервисФабрика;
Перем ТаблицаЦветов;
Перем ТаблицаКартинок;
Перем ТаблицаКредПредложений;

Перем Загрузчик;

////@+ Процедура ПолучитьДанные()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="21.05.2013 16:25:50" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьДанные()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ПолучитьДанные() Экспорт
	
	АдресWS	 = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	
	//удалим определение документа wsdl - его добавляем автоматически
	АдресWS = СтрЗаменить(АдресWS, "?wsdl", "");
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Credit.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/datatable", 
							   "ОтправкаНСИпоЗапросу","ОтправкаНСИпоЗапросуSoap12",600);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	Если ПолучитьЦвета тогда
		Цвета = ВебСервис.getcolors();
	КонецЕсли;
	
	Если ПолучитьКартинки тогда
		Картинки = ВебСервис.getimage();
	КонецЕсли;
	
	Если ПолучитьКредитныеПрограммы тогда
		КредитныеПредложения = ВебСервис.getcredit();
	КонецЕсли;
	
	ВебСервис = Неопределено;
	
	Если ПолучитьЦвета тогда
		РазобратьЦвета(Цвета);
		ЗагрузитьЦвета();
	КонецЕсли;
	
	Если ПолучитьКартинки тогда
		РазобратьКартинки(Картинки);
	КонецЕсли;
	
	Если ПолучитьКредитныеПрограммы тогда
		РазобратьКредПредложения(КредитныеПредложения);
	КонецЕсли;
	
КонецПроцедуры // ПолучитьДанные()

////@+ Процедура РазобратьРезультат(Результат)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="23.05.2013 16:21:35" Автор="Окипний Андрей Евгеньевич">
// <Имя>РазобратьРезультат(Результат)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>Результат</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура РазобратьЦвета(Цвета)
	
	ЭлементЦвет = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементЦвет"));
	СвойстваЗаписи = ЭлементЦвет.Свойства();
	
	ТаблицаЦветов = Новый ТаблицаЗначений;
	
	Для Каждого Свойство из СвойстваЗаписи Цикл
		ТаблицаЦветов.Колонки.Добавить(Свойство.Имя);
	КонецЦикла;
	
	Для Каждого Цвет из Цвета.Цвет Цикл
		
		НС = ТаблицаЦветов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Цвет);
		
	КонецЦикла;
	
КонецПроцедуры // РазобратьРезультат(Результат)

////@+ Процедура ЗагрузитьЦвета()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="24.05.2013 10:38:57" Автор="Окипний Андрей Евгеньевич">
// <Имя>ЗагрузитьЦвета()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ЗагрузитьЦвета()
	
	Для Каждого стрЦвет из ТаблицаЦветов Цикл
		
		НайденныйЦвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул", СокрЛП(стрЦвет.Артикул));
		
		Если НайденныйЦвет = Справочники.Цвета.ПустаяСсылка() тогда
			
			ЭлементЦвет = Справочники.Цвета.СоздатьЭлемент();
			
			ЗаполнитьЗначенияСвойств(ЭлементЦвет, стрЦвет);
			ЭлементЦвет.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЦвета()

////@+ Процедура РазобратьКартинки(Картинки)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="05.06.2013 12:26:20" Автор="Администратор Nissan">
// <Имя>РазобратьКартинки(Картинки)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>Картинки</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура РазобратьКартинки(Картинки) 
	
	ЭлементКартинка = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементКартинка"));
	СвойстваЗаписи = ЭлементКартинка.Свойства();
	
	ТаблицаКартинок = Новый ТаблицаЗначений;
	
	Для Каждого Свойство из СвойстваЗаписи Цикл
		ТаблицаКартинок.Колонки.Добавить(Свойство.Имя);
	КонецЦикла;
	
	Для Каждого стрКартинка из Картинки.Картинка Цикл
		
		НС = ТаблицаКартинок.Добавить();
		ЗаполнитьЗначенияСвойств(НС, стрКартинка);
		НС.Картинка = Новый Картинка(стрКартинка.Картинка);
		
	КонецЦикла;
	
	//Дополняем данные по моделям, цветам, комплектациям
	
	//////////////////////////////
	//	Модели
	МассивМоделей = ТаблицаКартинок.ВыгрузитьКолонку("КодМодели");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Модели.Ссылка,
	|	Модели.Артикул
	|ИЗ
	|	Справочник.Модели КАК Модели
	|ГДЕ
	|	НЕ Модели.Артикул = """"
	|	И Модели.Артикул В(&МассивМоделей)"
	);
	Запрос.УстановитьПараметр("МассивМоделей", МассивМоделей);
	ТаблицаМоделей = Запрос.Выполнить().Выгрузить();
	
	//////////////////////////////
	//	Цвета
	МассивЦветов = ТаблицаКартинок.ВыгрузитьКолонку("КодЦвета");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Цвета.Ссылка,
	|	Цвета.Артикул
	|ИЗ
	|	Справочник.Цвета КАК Цвета
	|ГДЕ
	|	НЕ Цвета.Артикул = """"
	|	И Цвета.Артикул В(&МассивЦветов)"
	);
	Запрос.УстановитьПараметр("МассивЦветов", МассивЦветов);
	ТаблицаЦветов = Запрос.Выполнить().Выгрузить();
	
	МассивКомплектаций = ТаблицаКартинок.ВыгрузитьКолонку("КодКомплектации");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВариантыКомплектации.Ссылка,
	|	ВариантыКомплектации.Артикул
	|ИЗ
	|	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
	|ГДЕ
	|	НЕ ВариантыКомплектации.Артикул = """"
	|	И ВариантыКомплектации.Артикул В(&МассивКомплектаций)"
	);
	Запрос.УстановитьПараметр("МассивКомплектаций",МассивКомплектаций);
	ТаблицаКомплектаций = Запрос.Выполнить().Выгрузить();
	
	//Теперь проставим модель, цвет, комплектацию в таблицу картинок
	ТаблицаКартинок.Колонки.Добавить("Модель");
	ТаблицаКартинок.Колонки.Добавить("Комплектация");
	ТаблицаКартинок.Колонки.Добавить("Цвет");
	
	Для Каждого стрКартинка из ТаблицаКартинок Цикл
		
		НайденнаяМодель = ТаблицаМоделей.Найти(стрКартинка.КодМодели, "Артикул");
		
		Если НЕ НайденнаяМодель = Неопределено тогда
			стрКартинка.Модель = НайденнаяМодель.Ссылка;
		Иначе
			стрКартинка.Модель = Справочники.Модели.ПустаяСсылка();
		КонецЕсли;
		
		НайденныйЦвет = ТаблицаЦветов.Найти(стрКартинка.КодЦвета, "Артикул");
		
		Если НЕ НайденныйЦвет = Неопределено тогда
			стрКартинка.Цвет = НайденныйЦвет.Ссылка;
		Иначе
			стрКартинка.Цвет = Справочники.Цвета.ПустаяСсылка();
		КонецЕсли;
		
		НайденнаяКомплектация = ТаблицаКомплектаций.Найти(стрКартинка.КодКомплектации, "Артикул");
		
		Если НЕ НайденнаяКомплектация = Неопределено тогда
			стрКартинка.Комплектация = НайденнаяКомплектация.Ссылка;
		иначе
			стрКартинка.Комплектация = Справочники.ВариантыКомплектации.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаКартинок.Колонки.Картинка.Имя = "Данные";
	
	ЗагрузитьКартинки();
	
КонецПроцедуры // РазобратьКартинки(Картинки)

////@+ Процедура ЗагрузитьКартинки()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="05.06.2013 14:22:33" Автор="Администратор Nissan">
// <Имя>ЗагрузитьКартинки()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ЗагрузитьКартинки()
	
	Для Каждого стрКартинка из ТаблицаКартинок Цикл
		
		Если НЕ ЗначениеЗаполнено(стрКартинка.Модель) тогда Продолжить; КонецЕсли;
		
		МЗИдентификатор = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МЗИдентификатор, стрКартинка);
		МЗИдентификатор.Прочитать();
		
		Если НЕ МЗИдентификатор.Выбран() тогда
			ЗаполнитьЗначенияСвойств(МЗИдентификатор, стрКартинка);
			МЗИдентификатор.Записать(Истина);
		КонецЕсли;
		
		МЗКартинка = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МЗКартинка, стрКартинка);
		МЗКартинка.Объект = стрКартинка.Модель;
		МЗКартинка.Прочитать();
		
		Если НЕ МЗКартинка.Выбран() тогда
			ЗаполнитьЗначенияСвойств(МЗКартинка, стрКартинка);
			МЗКартинка.Объект = стрКартинка.Модель;
			МЗКартинка.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьКартинки()

////@+ Процедура РазобратьКредПредложения(КредитныеПредложения)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="10.06.2013 10:39:21" Автор="Администратор Nissan">
// <Имя>РазобратьКредПредложения(КредитныеПредложения)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//  <Параметр>
//  <ИмяПараметра>КредитныеПредложения</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</xml>
//@-
Процедура РазобратьКредПредложения(КредитныеПредложения)
	
	ЭлементКредПредложение = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable","ЭлементКредитнаяПрограмма"));
	СвойстваЗаписи = ЭлементКредПредложение.Свойства();
	
	ТаблицаКредПредложений = Новый ТаблицаЗначений;
	
	Для Каждого Свойство из СвойстваЗаписи Цикл
		ТаблицаКредПредложений.Колонки.Добавить(Свойство.Имя);
	КонецЦикла;
	
	Для Каждого КредПредложение из КредитныеПредложения.КредитнаяПрограмма Цикл
		
		НС = ТаблицаКредПредложений.Добавить();
		ЗаполнитьЗначенияСвойств(НС, КредПредложение, ,"Банк,ПрименениеКредитныхПрограмм");
		
		НС.Банк = НайтиСоздатьБанк(КредПредложение.Банк);
		
		ТаблицаПрименений = СобратьПрименения(КредПредложение.ПрименениеКредитныхПрограмм.СтрокиПримКредПрограмм);
		НС.ПрименениеКредитныхПрограмм = ТаблицаПрименений;
		
	КонецЦикла;
	
	ЗагрузитьКредПредложения();
	
КонецПроцедуры // РазобратьКредПредложения()

////@+ Процедура ЗагрузитьКредПредложения()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="11.06.2013 11:35:05" Автор="Администратор Nissan">
// <Имя>ЗагрузитьКредПредложения()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ЗагрузитьКредПредложения() 
	
	Для каждого стрПредложение из ТаблицаКредПредложений цикл
		
		КредПредложениеСпр = Справочники.КредитныеПрограммы.НайтиПоРеквизиту("RenaultNissan_Идентификатор", стрПредложение.Идентификатор);
		
		Если НЕ ЗначениеЗаполнено(КредПредложениеСпр) тогда
			КредПредложениеОбъект = Справочники.КредитныеПрограммы.СоздатьЭлемент();
		Иначе
			КредПредложениеОбъект = КредПредложениеСпр.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(КредПредложениеОбъект, стрПредложение);
		
		КредПредложениеОбъект.Записать();
		
		КредПредложениеСпр = КредПредложениеОбъект.Ссылка;
		
		//Пишем данные в регистры
		
		//Доп. параметры
		МЗ = РегистрыСведений.CRM_ПараметрыКредитныхПрограмм.СоздатьМенеджерЗаписи();
		
		МЗ.КредитнаяПрограмма = КредПредложениеСпр;
		МЗ.Прочитать();
		
		Если НЕ МЗ.Выбран() тогда
			МЗ.КредитнаяПрограмма = КредПредложениеСпр;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МЗ, стрПредложение);
		МЗ.Записать();
		
		//Применяемость
		ТаблицаПрименений = стрПредложение.ПрименениеКредитныхПрограмм;
		ТаблицаПрименений.ЗаполнитьЗначения(КредПредложениеСпр, "КредитнаяПрограмма");
		
		НЗ = РегистрыСведений.CRM_ПрименениеКредитныхПрограмм.СоздатьНаборЗаписей();
		
		НЗ.Отбор.КредитнаяПрограмма.Установить(КредПредложениеСпр);
		
		НЗ.Прочитать();
		НЗ.Очистить();
		
		НЗ.Загрузить(ТаблицаПрименений);
		НЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьКредПредложения()

////@+ Процедура ОбработкаНаСервере()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="30.05.2013 17:07:31" Автор="Окипний Андрей Евгеньевич">
// <Имя>ОбработкаНаСервере()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Процедура ОбработкаНаСервере() Экспорт
	
	ПолучитьДанные();
	
КонецПроцедуры // ОбработкаНаСервере()

////@+ Функция НайтиСоздатьБанк(БанкXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="11.06.2013 9:38:27" Автор="Администратор Nissan">
// <Имя>НайтиСоздатьБанк(БанкXDTO)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>Банк</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//
//  <Результат>
//  	<ИмяРезультата>БанкСсылка</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип результата --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция НайтиСоздатьБанк(БанкXDTO) 
	
	//Первоначальная инициализация
	БанкСсылка = неопределено;
	
	БанкСсылка = Справочники.Банки.НайтиПоКоду(СокрЛП(БанкXDTO.БикБанка));
	
	Если НЕ ЗначениеЗаполнено(БанкСсылка) тогда
		
		БанкОбъект = Справочники.Банки.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(БанкОбъект, БанкXDTO);
		
		БанкОбъект.Код = БанкXDTO.БикБанка;
		
		БанкОбъект.Записать();
		
		БанкСсылка = БанкОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат БанкСсылка;
	
КонецФункции // НайтиСоздатьБанк(БанкXDTO)

////@+ Функция СобратьПрименения(ПримененияXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="11.06.2013 9:44:30" Автор="Администратор Nissan">
// <Имя>СобратьПрименения(ПримененияXDTO)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>ПримененияXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//
//  <Результат>
//  	<ИмяРезультата>ТаблицаПрименения</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип результата --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция СобратьПрименения(ПримененияXDTO)
	
	//Первоначальная инициализация
	ТаблицаПрименения = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	CRM_ПрименениеКредитныхПрограмм.Модель,
	|	CRM_ПрименениеКредитныхПрограмм.Версия,
	|	CRM_ПрименениеКредитныхПрограмм.ГодПроизводства,
	|	CRM_ПрименениеКредитныхПрограмм.КредитнаяПрограмма,
	|	CRM_ПрименениеКредитныхПрограмм.ПГВПодарок
	|ИЗ
	|	РегистрСведений.CRM_ПрименениеКредитныхПрограмм КАК CRM_ПрименениеКредитныхПрограмм"
	);
	
	ТаблицаПрименения = Запрос.Выполнить().Выгрузить();
	
	Если ПримененияXDTO.Количество() = 0 Тогда Возврат ТаблицаПрименения КонецЕсли;
	
	Для Каждого стрПрименение из ПримененияXDTO цикл
		
		НС = ТаблицаПрименения.Добавить();
		
		НС.Модель = НайтиСоздатьМодель(стрПрименение.Модель);
		НС.Версия = НайтиСоздатьВерсию(стрПрименение.Версия);
		НС.ГодПроизводства = стрПрименение.ГодПроизводства;
		НС.ПГВПодарок = НайтиСоздатьПродленнуюГарантию(стрПрименение.ПГВПодарок);
		
	КонецЦикла;
	
	Возврат ТаблицаПрименения;
	
КонецФункции // СобратьПрименения(ПримененияXDTO)

////@+ Функция СоздатьМодель(МодельXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="10.06.2013 17:30:25" Автор="Администратор Nissan">
// <Имя>СоздатьМодель(МодельXDTO)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>МодельXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//
//  <Результат>
//  	<ИмяРезультата>МодельСпр</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип результата --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция НайтиСоздатьМодель(МодельXDTO)
	
	//Первоначальная инициализация
	МодельСпр = неопределено;
	
	МодельСпр = Справочники.Модели.НайтиПоРеквизиту("Артикул", СокрЛП(МодельXDTO.Артикул));
	
	Если НЕ ЗначениеЗаполнено(МодельСпр) тогда
		
		МодельОб = Справочники.Модели.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(МодельОб, МодельXDTO, , "ДоступныеЦвета,КодВалютыУчета");
		
		//Обязательные реквизиты
		МодельОб.ВалютаУчета	 = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		МодельОб.УстановитьНовыйКод();
		
		МодельОб.Записать();
		
		МодельСпр = МодельОб.Ссылка;
		
	КонецЕсли;
	
	Возврат МодельСпр;
	
КонецФункции // СоздатьМодель(МодельXDTO)

////@+ Функция СоздатьВерсию(ВерсияXDTO)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="10.06.2013 17:36:26" Автор="Администратор Nissan">
// <Имя>СоздатьВерсию(ВерсияXDTO)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>ВерсияXDTO</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//
//  <Результат>
//  	<ИмяРезультата>ВерсияСпр</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип результата --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция НайтиСоздатьВерсию(ВерсияXDTO)
	
	//Первоначальная инициализация
	ВерсияСпр = неопределено;
	
	ВерсияСпр = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СокрЛП(ВерсияXDTO.Артикул));
	
	Если НЕ ЗначениеЗаполнено(ВерсияСпр) тогда
		
		ВерсияОб = Справочники.ВариантыКомплектации.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ВерсияОб, ВерсияXDTO, ,"Владелец, КодВалютыУчета");
		
		ВерсияОб.УстановитьНовыйКод();
		ВерсияОб.ВалютаУчета		 = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		МодельВладелец = Справочники.Модели.НайтиПоРеквизиту("Артикул", СокрЛП(ВерсияXDTO.Владелец.Артикул));
		Если НЕ ЗначениеЗаполнено(МодельВладелец) тогда
			МодельВладелец = НайтиСоздатьМодель(ВерсияXDTO.Владелец);
		КонецЕсли;
		
		ВерсияОб.Владелец = МодельВладелец;
		
		ВерсияОб.Записать();
		
		ВерсияСпр = ВерсияОб.Ссылка;
		
	КонецЕсли;
	
	Возврат ВерсияСпр;
	
КонецФункции // СоздатьВерсию(ВерсияXDTO)

////@+ Функция НайтиСоздатьПродленнуюГарантию(ПГВПодарок)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции=""
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="11.06.2013 11:09:41" Автор="Администратор Nissan">
// <Имя>НайтиСоздатьПродленнуюГарантию(ПГВПодарок)</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>ПГВПодарок</ИмяПараметра>
//  	<ТипПараметра><!-- Укажите тип параметра --></ТипПараметра>
//  	<ОписаниеПараметра><!-- описание параметра -->
//                 <!-- продолжение описания параметра --></ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//
//  <Результат>
//  	<ИмяРезультата>ПродленнаяГарантия</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип результата --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция НайтиСоздатьПродленнуюГарантию(ПГВПодарок) 
	
	//Первоначальная инициализация
	ПродленнаяГарантия = неопределено;
	
	ПродленнаяГарантия = Справочники.CRM_ПредложенияПродленнойГарантии.НайтиПоРеквизиту("Идентификатор", СокрЛП(ПГВПодарок.Идентификатор));
	
	Если НЕ ЗначениеЗаполнено(ПродленнаяГарантия) тогда
		
		ПродленнаяГарантияОб = Справочники.CRM_ПредложенияПродленнойГарантии.СоздатьЭлемент();
		ПродленнаяГарантияОб.УстановитьНовыйКод();
		ПродленнаяГарантияОб.Наименование = СокрЛП(ПГВПодарок.Наименование);
		
		ПродленнаяГарантияОб.Записать();
		ПродленнаяГарантия = ПродленнаяГарантияОб.Ссылка;
		
	КонецЕсли;
	
	Возврат ПродленнаяГарантия;
	
КонецФункции // НайтиСоздатьПродленнуюГарантию(ПГВПодарок)
